Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm-up Phase"
    - duration: 60
      arrivalRate: 25
      rampTo: 100
      name: "Ramping Load"
    - duration: 120
      arrivalRate: 100
      name: "Sustained Peak Load"
  plugins:
    expect: {}
  defaults:
    headers:
      User-Agent: "Artillery-AgroSentry-LoadTest/1.0"

scenarios:
  - name: "Public Browsing & Knowledge Discovery"
    weight: 40
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/scans/diseases"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/tips"
          expect:
            - statusCode: 200

  - name: "User Authentication & Diagnosis History"
    weight: 60
    flow:
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "username=mahiworkmail6@gmail.com&password=Mahi@Admin6"
          capture:
            - json: "$.access_token"
              as: "jwt_token"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/scans/history"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/notifications"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: 200
